const search = document.querySelector(".search");
const checkbox = document.querySelector(".poem");
const next = document.querySelector(".nxt");
const prev = document.querySelector(".pre");
const ul = document.querySelector("ul");
const h6 = document.querySelector("h6");
const audio = document.querySelectorAll("audio");

const poem = [
  {
    1: "برخیز بتا بیا ز بهر دل ما",
    2: "حل کن به جمال خویشتن مشکل ما",
    3: "یک کوزه شراب تا به هم نوش کنیم",
    4: "زآن پیش که کوزه‌ها کنند از گل ما",
  },
  {
    1: "چون عهده نمی‌شود کسی فردا را",
    2: "حالی خوش کن تو این دل شیدا را",
    3: "می نوش به نور ماه ای ماه که ماه",
    4: "بسیار بتابد و نیابد ما را",
  },
  {
    1: "قرآن که مهین کلام خوانند آن را",
    2: "گهگاه نه بر دوام خوانند آن را",
    3: "بر گرد پیاله آیتی هست مقیم",
    4: "کاندر همه جا مدام خوانند آن را",
  },
  {
    1: "گر می نخوری طعنه مزن مستان را",
    2: "بنیاد مکن تو حیله و دستان را",
    3: "تو غره بدان مشو که می می‌نخوری",
    4: "صد لقمه خوری که می غلام است آن را",
  },
  {
    1: "هر چند که رنگ و بوی زیباست مرا",
    2: "چون لاله رخ و چو سرو بالاست مرا",
    3: "معلوم نشد که در طربخانۀ خاک",
    4: "نقاش ازل بهر چه آراست مرا",
  },
  {
    1: "ماییم و می و مطرب و این کنج خراب",
    2: "جان و دل و جام و جامه پر درد شراب",
    3: "فارغ ز امید رحمت و بیم عذاب",
    4: "آزاد ز خاک و باد و از آتش و آب",
  },
  {
    1: "آن قصر که جمشید در او جام گرفت",
    2: "آهو بچه کرد و روبه آرام گرفت",
    3: "بهرام که گور می‌گرفتی همه عمر",
    4: "دیدی که چگونه گور بهرام گرفت",
  },
  {
    1: "ابر آمد و زار بر سرِ سبزه گریست",
    2: "بی بادهٔ گلرنگ نمی‌شاید زیست",
    3: "این سبزه که امروز تماشاگه ماست",
    4: "تا سبزهٔ خاک ما تماشاگه کیست",
  },
  {
    1: "اکنون که گل سعادتت پربار است",
    2: "دست تو ز جام می چرا بیکار است",
    3: "می خور که زمانه دشمنی غدار است",
    4: "دریافتن روز چنین دشوار است",
  },
  {
    1: "امروز تو را دسترس فردا نیست",
    2: "واندیشهٔ فردات به جز سودا نیست",
    3: "ضایع مکن این دم ار دلت شیدا نیست",
    4: "کاین باقی عمر را بها پیدا نیست",
  },
  {
    1: "ای آمده از عالم روحانی تفت",
    2: "حیران شده در پنج و چهار و شش و هفت",
    3: "می نوش ندانی ز کجا آمده‌ای",
    4: "خوش باش ندانی به کجا خواهی رفت",
  },
  {
    1: "ای چرخ فلک خرابی از کینهٔ توست",
    2: "بیدادگری شیوهٔ دیرینهٔ توست",
    3: "ای خاک اگر سینه تو بشکافند",
    4: "بس گوهر قیمتی که در سینهٔ توست",
  },
  {
    1: "ای دل چو زمانه می‌کند غمناکت",
    2: "ناگه برود ز تن روان پاکت",
    3: "بر سبزه نشین و خوش بزی روزی چند",
    4: "زآن پیش که سبزه بر دمد از خاکت",
  },
  {
    1: "این بحر وجود آمده بیرون ز نهفت",
    2: "کس نیست که این گوهر تحقیق بسفت",
    3: "هر کس سخنی از سر سودا گفتند",
    4: "زآن روی که هست کس نمی‌داند گفت",
  },
  {
    1: "این کوزه چو من عاشق زاری بوده‌ست",
    2: "در بند سر زلف نگاری بوده‌ست",
    3: "این دسته که بر گردن او می‌بینی",
    4: "دستی‌ست که بر گردن یاری بوده‌ست",
  },
  {
    1: "این کوزه که آبخوارهٔ مزدوری‌ست",
    2: "از دیدهٔ شاهی و دل دستوری‌ست",
    3: "هر کاسهٔ می که بر کف مخموری‌ست",
    4: "از عارض مستی و لب مستوری‌ست",
  },
  {
    1: "این کهنه رباط را که عالم نام است",
    2: "وآرامگه ابلق صبح و شام است",
    3: "بزمی‌ست که واماندۀ صد جمشید است",
    4: "قصری‌ست که تکیه‌گاه صد بهرام است",
  },
  {
    1: "این یک دو سه روز نوبت عمر گذشت",
    2: "چون آب به جویبار و چون باد به دشت",
    3: "هرگز غم دو روز مرا یاد نگشت",
    4: "روزی که نیامده‌ست و روزی که گذشت",
  },
  {
    1: "بر چهرۀ گل نسیم نوروز خوش است",
    2: "در صحن چمن روی دل‌افروز خوش است",
    3: "از دی که گذشت هر چه گویی خوش نیست",
    4: "خوش باش و ز دی مگو که امروز خوش است",
  },
  {
    1: "پیش از من و تو لیل و نهاری بوده‌ست",
    2: "گردنده فلک نیز بکاری بوده است",
    3: "هرجا که قدم نهی تو بر روی زمین",
    4: "آن مردمک چشم نگاری بوده‌ست",
  },
  {
    1: "تا چند زنم به روی دریاها خشت",
    2: "بیزار شدم ز بت‌پرستان کنشت",
    3: "خیام ، که گفت دوزخی خواهد بود",
    4: "که رفت به دوزخ و که آمد ز بهشت",
  },
  {
    1: "ترکیب پیاله‌ای که در هم پیوست",
    2: "بشکستن آن روا نمی‌دارد مست",
    3: "چندین سر و پای نازنین از سر و دست",
    4: "از مهر که پیوست و به کین که شکست",
  },
  {
    1: "ترکیب طبایع چو به کام تو دمی‌ست",
    2: "رو شاد بزی اگرچه بر تو ستمی‌ست",
    3: "با اهل خرد باش که اصل تن تو",
    4: "گردی و نسیمی و غباری و دمی‌ست",
  },
  {
    1: "چون ابر به نوروز رخ لاله بشست",
    2: "برخیز و به جام باده کن عزم درست",
    3: "کاین سبزه که امروز تماشاگه توست",
    4: "فردا همه از خاک تو برخواهد رست",
  },
  {
    1: "چون بلبل مست راه در بستان یافت",
    2: "روی گل و جام باده را خندان یافت",
    3: "آمد به زبان حال در گوشم گفت",
    4: "دریاب که عمر رفته را نتوان یافت",
  },
  {
    1: "چون چرخ به کام یک خردمند نگشت",
    2: "خواهی تو فلک هفت شمر خواهی هشت",
    3: "چون باید مرد و آرزوها همه هشت",
    4: "چه مور خورد به گور و چه گرگ به دشت",
  },
  {
    1: "چون لاله به نوروز قدح گیر به دست",
    2: "با لاله‌رخی اگر تو را فرصت هست",
    3: "می نوش به خرمی که این چرخ کهن",
    4: "ناگاه تو را چو خاک گرداند پست",
  },
  {
    1: "چون نیست حقیقت و یقین اندر دست",
    2: "نتوان به امید شک همه عمر نشست",
    3: "هان تا ننهیم جام می از کف دست",
    4: "در بی‌خبری مرد چه هشیار و چه مست",
  },
  {
    1: "چون نیست ز هرچه هست جز باد به دست",
    2: "چون هست به هرچه هست نقصان و شکست",
    3: "انگار که هرچه هست در عالم نیست",
    4: "پندار که هرچه نیست در عالم هست",
  },
  {
    1: "خاکی که به زیر پای هر نادانی‌ست",
    2: "کفّ صنمیّ و چهرهٔ جانانی‌ست",
    3: "هر خشت که بر کنگرهٔ ایوانی‌ست",
    4: "انگشت وزیر یا سر سلطانی‌ست",
  },
  {
    1: "دارنده چو ترکیب طبایع آراست",
    2: "از بهر چه اوفکندش اندر کم و کاست",
    3: "گر نیک آمد شکستن از بهر چه بود",
    4: "ور نیک نیامد این صور عیب که راست",
  },
  {
    1: "در پردۀ اسرار کسی را ره نیست",
    2: "زین تعبیه جان هیچ‌کس آگه نیست",
    3: "جز در دل خاک هیچ منزلگه نیست",
    4: "می خور که چنین فسانه‌ها کوته نیست",
  },
  {
    1: "در خواب بدم مرا خردمندی گفت",
    2: "کز خواب کسی را گل شادی نشکفت",
    3: "کاری چه کنی که با اجل باشد جفت؟",
    4: "می خور که به زیر خاک می‌باید خفت",
  },
  {
    1: "در دایره‌ای که آمد و رفتن ماست",
    2: "او را نه بدایت نه نهایت پیداست",
    3: "کس می‌نزند دمی در این معنی راست",
    4: "کاین آمدن از کجا و رفتن به کجاست",
  },
  {
    1: "در فصل بهار اگر بتی حور سرشت",
    2: "یک ساغر می دهد مرا بر لب کشت",
    3: "هر چند به نزد عامه این باشد زشت",
    4: "سگ به ز من است اگر برم نام بهشت",
  },
  {
    1: "دریاب که از روح جدا خواهی رفت",
    2: "در پردۀ اسرار فنا خواهی رفت",
    3: "می نوش ندانی از کجا آمده‌ای",
    4: "خوش باش ندانی به کجا خواهی رفت",
  },
  {
    1: "ساقی گل و سبزه بس طربناک شده‌ست",
    2: "دریاب که هفته دگر خاک شده‌ست",
    3: "می نوش و گلی بچین که تا درنگری",
    4: "گل خاک شده‌ست و سبزه خاشاک شده‌ست",
  },
  {
    1: "عمری‌ست مرا تیره و کاری‌ست نه راست",
    2: "محنت همه افزوده و راحت کم و کاست",
    3: "شکر ایزد را که آنچه اسباب بلاست",
    4: "ما را ز کس دگر نمی‌باید خواست",
  },
  {
    1: "فصل گل و طرف جویبار و لب کشت",
    2: "با یک دو سه اهل و لعبتی حورسرشت",
    3: "پیش آر قدح که باده‌نوشان صبوح",
    4: "آسوده ز مسجدند و فارغ ز کنشت",
  },
  {
    1: "گر شاخ بقا ز بیخ بختت رستست",
    2: "ور بر تن تو عمر لباسی چستست",
    3: "در خیمه تن که سایبانی‌ست ترا",
    4: "هان تکیه مکن که چارمیخش سستست",
  },
  {
    1: "گویند کسان بهشت با حور خوش است",
    2: "من می‌گویم که آب انگور خوش است",
    3: "این نقد بگیر و دست از آن نسیه بدار",
    4: "کآواز دهل شنیدن از دور خوش است",
  },
  {
    1: "گویند که دوزخی بُوَد عاشق و مست",
    2: "قولی‌ست خلاف، دل در آن نتوان بست",
    3: "گر عاشق و مست دوزخی خواهد بود",
    4: "فردا باشد بهشت همچون کفِ دست",
  },
  {
    1: "من هیچ ندانم که مرا آن‌که سرشت",
    2: "از اهل بهشت کرد یا دوزخ زشت",
    3: "جامی و بتی و بربطی بر لب کشت",
    4: "این هرسه مرا نقد و تو را نسیه بهشت",
  },
  {
    1: "مهتاب به نور دامن شب بشکافت",
    2: "می نوش دمی بهتر از این نتوان یافت",
    3: "خوش باش و میندیش که مهتاب بسی",
    4: "اندر سر خاک یک به یک خواهد تافت",
  },
  {
    1: "می خوردن و شاد بودن آیین من است",
    2: "فارغ بودن ز کفر و دین دین من است",
    3: "گفتم به عروس دهر کابین تو چیست",
    4: "گفتا دل خرم تو کابین من است",
  },
  {
    1: "می لعل مذاب است و صراحی کان است",
    2: "جسم است پیاله و شرابش جان است",
    3: "آن جام بلورین که ز می خندان است",
    4: "اشکی است که خون دل در او پنهان است",
  },
  {
    1: "می نوش که عمر جاودانی این است",
    2: "خود حاصلت از دور جوانی این است",
    3: "هنگام گل و مل است و یاران سرمست",
    4: "خوش باش دمی که زندگانی این است",
  },
  {
    1: "نیکی و بدی که در نهاد بشر است",
    2: "شادی و غمی که در قضا و قدر است",
    3: "با چرخ مکن حواله کاندر ره عقل",
    4: "چرخ از تو هزار بار بیچاره‌تر است",
  },
  {
    1: "در هر دشتی که لاله‌زاری بوده‌ست",
    2: "از سرخی خون شهریاری بوده‌ست",
    3: "هر شاخ بنفشه کز زمین می‌روید",
    4: "خالی‌ست که بر رخ نگاری بوده‌ست",
  },
  {
    1: "هر ذره که در خاک زمینی بوده‌ست",
    2: "پیش از من و تو تاج و نگینی بوده‌ست",
    3: "گرد از رخ نازنین به آزرم فشان",
    4: "کآن هم رخ خوب نازنینی بوده‌ست",
  },
  {
    1: "هر سبزه که بر کنار جویی رسته‌ست",
    2: "گویی ز لب فرشته‌خویی رسته‌ست",
    3: "پا بر سر سبزه تا به خواری ننهی",
    4: "کآن سبزه ز خاک لاله‌رویی رسته‌ست",
  },
  {
    1: "یک جرعهٔ می ز ملک کاووس به است",
    2: "از تخت قباد و ملکت طوس به است",
    3: "هر ناله که رندی به سحرگاه زند",
    4: "از طاعت زاهدان سالوس به است",
  },
  {
    1: "چون عمر به سر رسد، چه بغداد چه بلخ",
    2: "پیمانه چو پر شود، چه شیرین و چه تلخ",
    3: "خوش باش که بعد از من و تو ماه بسی",
    4: "از سَلْخ به غره آید، از غره به سَلْخ",
  },
  {
    1: "آنان که محیط فضل و آداب شدند",
    2: "در جمع کمال شمع اصحاب شدند",
    3: "ره زین شب تاریک نبردند به روز",
    4: "گفتند فسانه‌ای و در خواب شدند",
  },
  {
    1: "آن را که به صحرای علل تاخته‌اند",
    2: "بی او همه کارها بپرداخته‌اند",
    3: "امروز بهانه‌ای درانداخته‌اند",
    4: "فردا همه آن بود که درساخته‌اند",
  },
  {
    1: "آن‌ها که کهن شدند و این‌ها که نوند",
    2: "هر کس به مراد خویش یک تک به دوند",
    3: "این کهنه‌جهان به کس نماند باقی",
    4: "رفتند و رویم دیگر آیند و روند",
  },
  {
    1: "آن‌کس که زمین و چرخ و افلاک نهاد",
    2: "بس داغ که او بر دل غمناک نهاد",
    3: "بسیار لب چو لعل و زلفین چو مشک",
    4: "در طبل زمین و حقهٔ خاک نهاد",
  },
  {
    1: "آرند یکی و دیگری بربایند",
    2: "بر هیچ‌کسی راز همی‌نگشایند",
    3: "ما را ز قضا جز این قدر ننمایند",
    4: "پیمانهٔ عمر ماست می‌پیمایند",
  },
  {
    1: "اجرام که ساکنان این ایوان‌اند",
    2: "اسباب تردد خردمندان‌اند",
    3: "هان تا سر رشتهٔ خرد گم نکنی",
    4: "کآنان که مدبرند سرگردان‌اند",
  },
  {
    1: "از آمدنم نبود گردون را سود",
    2: "وز رفتن من جاه و جلالش نفزود",
    3: "وز هیچ کسی نیز دو گوشم نشنود",
    4: "کاین آمدن و رفتنم از بهر چه بود",
  },
  {
    1: "از رنج کشیدن آدمی حر گردد",
    2: "قطره چو کشد حبس صدف در گردد",
    3: "گر مال نماند سر بماناد به جای",
    4: "پیمانه چو شد تهی دگر پر گردد",
  },
  {
    1: "افسوس که سرمایه ز کف بیرون شد",
    2: "وز دست اجل بسی جگرها خون شد",
    3: "کس نآمد از آن جهان که پرسم از وی",
    4: "کاحوال مسافران دنیا چون شد",
  },
  {
    1: "افسوس که نامهٔ جوانی طی شد",
    2: "و آن تازه بهار زندگانی دی شد",
    3: "آن مرغ طرب که نام او بود شباب",
    4: "افسوس ندانم که کی آمد کی شد",
  },
  {
    1: "ای بس که نباشیم و جهان خواهد بود",
    2: "نی نام ز ما و نی‌ نشان خواهد بود",
    3: "زین پیش نبودیم و نبد هیچ خلل",
    4: "زین پس چو نباشیم همان خواهد بود",
  },
  {
    1: "این عقل که در ره سعادت پوید",
    2: "روزی صد بار خود تو را می‌گوید",
    3: "دریاب تو این یک دم وقتت که نه‌ای",
    4: "آن تره که بدروند و دیگر روید",
  },
  {
    1: "این قافله عمر عجب می گذرد",
    2: "دریاب دمی که با طرب می گذرد",
    3: "ساقی غم فردای حریفان چه خوری",
    4: "پیشار پیاله را که شب می گذرد",
  },
  {
    1: "بر پشت من از زمانه تو می‌آید",
    2: "وز من همه کار نانکو می‌آید",
    3: "جان عزم رحیل کرد و گفتم بمرو",
    4: "گفتا چه کنم خانه فرومی‌آید",
  },
  {
    1: "بر چرخ فلک هیچ کسی چیر نشد",
    2: "وز خوردن آدمی زمین سیر نشد",
    3: "مغرور بدانی که نخورده‌ست تو را",
    4: "تعجیل مکن هم بخورد دیر نشد",
  },
  {
    1: "بر چشم تو عالم ارچه می‌آرایند",
    2: "مگرای بدان که عاقلان نگرایند",
    3: "بسیار چو تو روند و بسیار آیند",
    4: "بربای نصیب خویش کت بربایند",
  },
  {
    1: "بر من قلم قضا چو بی من رانند",
    2: "پس نیک و بدش ز من چرا می‌دانند",
    3: "دی بی من و امروز چو دی بی من و تو",
    4: "فردا به چه حجتم به داور خوانند",
  },
  {
    1: "تا چند اسیر رنگ و بو خواهی شد",
    2: "چند از پی هر زشت و نکو خواهی شد",
    3: "گر چشمهٔ زمزمی و گر آب حیات",
    4: "آخر به دل خاک فروخواهی شد",
  },
  {
    1: "تا راه قلندری نپویی نشود",
    2: "رخساره بخون دل نشویی نشود",
    3: "سودا چه پزی تا که چو دلسوختگان",
    4: "آزاد به ترک خود نگویی نشود",
  },
  {
    1: "تا زهره و مه در آسمان گشت پدید",
    2: "بهتر ز می ناب کسی هیچ ندید",
    3: "من در عجبم ز می‌فروشان کایشان",
    4: "به زآن‌که فروشند چه خواهند خرید",
  },
  {
    1: "چون روزی و عمر بیش و کم نتوان کرد",
    2: "دل را به کم و بیش دژم نتوان کرد",
    3: "کار من و تو چنان‌که رای من و توست",
    4: "از موم به دست خویش هم نتوان کرد",
  },
  {
    1: "حیی که به قدرت سر و رو می‌سازد",
    2: "همواره همو کار عدو می‌سازد",
    3: "گویند قرابه‌گر مسلمان نبود",
    4: "او را تو چه گویی که کدو می‌سازد",
  },
  {
    1: "در دهر چو آواز گل تازه دهند",
    2: "فرمای بتا که می به‌اندازه دهند",
    3: "از حور و قصور و ز بهشت و دوزخ",
    4: "فارغ بنشین که آن هر آوازه دهند",
  },
  {
    1: "در دهر هر آن‌که نیم‌نانی دارد",
    2: "از بهر نشست آشیانی دارد",
    3: "نه خادم کس بود نه مخدوم کسی",
    4: "گو شاد بزی که خوش‌جهانی دارد",
  },
  {
    1: "دهقان قضا بسی چو ما کشت و درود",
    2: "غم خوردن بیهوده نمی‌دارد سود",
    3: "پر کن قدح می به کفم درنه زود",
    4: "تا باز خورم که بودنی‌ها همه بود",
  },
  {
    1: "روزی‌ست خوش و هوا نه گرم است و نه سرد",
    2: "ابر از رخ گلزار همی‌شوید گرد",
    3: "بلبل به زبان حال خود با گل زرد",
    4: "فریاد همی‌کند که می باید خورد",
  },
  {
    1: "زآن پیش که بر سرت شبیخون آرند",
    2: "فرمای که تا بادهٔ گلگون آرند",
    3: "تو زر نه‌ای ای غافل نادان که تو را",
    4: "در خاک نهند و باز بیرون آرند",
  },
  {
    1: "عمرت تا کی به خودپرستی گذرد",
    2: "یا در پی نیستی و هستی گذرد",
    3: "می نوش که عمری که اجل در پی اوست",
    4: "آن به که به خواب یا به مستی گذرد",
  },
  {
    1: "کس مشکل اسرار اجل را نگشاد",
    2: "کس یک قدم از دایره بیرون ننهاد",
    3: "من می‌نگرم ز مبتدی تا استاد",
    4: "عجز است به دست هرکه از مادر زاد",
  },
  {
    1: "کم کن طمع از جهان و می‌زی خرسند",
    2: "از نیک و بد زمانه بگسل پیوند",
    3: "می در کف و زلف دلبری گیر که زود",
    4: "هم بگذرد و نماند این روزی چند",
  },
  {
    1: "گرچه غم و رنج من درازی دارد",
    2: "عیش و طرب تو سرفرازی دارد",
    3: "بر هر دو مکن تکیه که دوران فلک",
    4: "در پرده هزار گونه بازی دارد",
  },
  {
    1: "گردون ز زمین هیچ گلی برنارد",
    2: "کش نشکند و هم به زمین نسپارد",
    3: "گر ابر چو آب خاک را بردارد",
    4: "تا حشر همه خون عزیزان بارد",
  },
  {
    1: "گر یک نفست ز زندگانی گذرد",
    2: "مگذار که جز به شادمانی گذرد",
    3: "هشدار که سرمایهٔ سودای جهان",
    4: "عمر است چنان کش گذرانی گذرد",
  },
  {
    1: "گویند بهشت و حورعین خواهد بود",
    2: "آنجا می و شیر و انگبین خواهد بود",
    3: "گر ما می و معشوق گزیدیم چه باک",
    4: "چون عاقبت کار چنین خواهد بود",
  },
  {
    1: "گویند بهشت و حور و کوثر باشد",
    2: "جوی می و شیر و شهد و شکر باشد",
    3: "پر کن قدح باده و بر دستم نه",
    4: "نقدی ز هزار نسیه خوش‌تر باشد",
  },
  {
    1: "گویند هر آن کسان که با پرهیزند",
    2: "زآن‌سان که بمیرند چنان برخیزند",
    3: "ما با می و معشوقه از آنیم مدام",
    4: "باشد که به حشرمان چنان انگیزند",
  },
  {
    1: "می خور که ز دل کثرت و قلت ببرد",
    2: "و اندیشه هفتاد و دو ملت ببرد",
    3: "پرهیز مکن ز کیمیایی که از او",
    4: "یک جرعه خوری هزار علت ببرد",
  },
  {
    1: "هر راز که اندر دل دانا باشد",
    2: "باید که نهفته‌تر ز عنقا باشد",
    3: "کاندر صدف از نهفتگی گردد در",
    4: "آن قطره که راز دل دریا باشد",
  },
  {
    1: "هر صبح که روی لاله شبنم گیرد",
    2: "بالای بنفشه در چمن خم گیرد",
    3: "انصاف مرا ز غنچه خوش می‌آید",
    4: "کاو دامن خویشتن فراهم گیرد",
  },
  {
    1: "هرگز دل من ز علم محروم نشد",
    2: "کم ماند ز اسرار که معلوم نشد",
    3: "هفتاد و دو سال فکر کردم شب و روز",
    4: "معلومم شد که هیچ معلوم نشد",
  },
  {
    1: "هم دانهٔ امید به خرمن ماند",
    2: "هم باغ و سرای بی تو و من ماند",
    3: "سیم و زر خویش از درمی تا به جوی",
    4: "با دوست بخور گرنه به دشمن ماند",
  },
  {
    1: "یاران موافق همه از دست شدند",
    2: "در پای اجل یکان یکان پست شدند",
    3: "خوردیم ز یک شراب در مجلس عمر",
    4: "دوری دو سه پیشتر ز ما مست شدند",
  },
  {
    1: "یک جام شراب صد دل و دین ارزد",
    2: "یک جرعهٔ می مملکت چین ارزد",
    3: "جز بادهٔ لعل نیست در روی زمین",
    4: "تلخی که هزار جان شیرین ارزد",
  },
  {
    1: "یک قطرهٔ آب بود با دریا شد",
    2: "یک ذرهٔ خاک با زمین یکتا شد",
    3: "آمدشدن تو اندر این عالم چیست",
    4: "آمد مگسی پدید و ناپیدا شد",
  },
  {
    1: "یک نان به دو روز اگر بود حاصل مرد",
    2: "از کوزه شکسته‌ای دمی آبی سرد",
    3: "مأمور کم از خودی چرا باید بود",
    4: "یا خدمت چون خودی چرا باید کرد",
  },
  {
    1: "آن لعل در آبگینهٔ ساده بیار",
    2: "وآن محرم و مونس هر آزاده بیار",
    3: "چون می‌دانی که مدت عالم خاک",
    4: "باد است که زود بگذرد باده بیار",
  },
  {
    1: "از بودنی ای دوست چه داری تیمار",
    2: "وز فکرت بیهوده دل و جان افکار",
    3: "خرم بزی و جهان به شادی گذران",
    4: "تدبیر نه با تو کرده‌اند اول کار",
  },
  {
    1: "افلاک که جز غم نفزایند دگر",
    2: "ننهند به جا تا نربایند دگر",
    3: "ناآمدگان اگر بدانند که ما",
    4: "از دهر چه می‌کشیم نایند دگر",
  },
  {
    1: "ای دل غم این جهان فرسوده مخور",
    2: "بیهوده نه‌ای غمان بیهوده مخور",
    3: "چون بوده گذشت و نیست نابوده پدید",
    4: "خوش باش غم بوده و نابوده مخور",
  },
  {
    1: "ایدل همه اسباب جهان خواسته گیر",
    2: "باغ طربت به سبزه آراسته گیر",
    3: "و آنگاه بر آن سبزه شبی چون شبنم",
    4: "بنشسته و بامداد برخاسته گیر",
  },
  {
    1: "این اهل قبور خاک گشتند و غبار",
    2: "هر ذره ز هر ذره گرفتند کنار",
    3: "آه این چه شراب است که تا روز شمار",
    4: "بیخود شده و بی‌خبرند از همه کار",
  },
  {
    1: "خشت سر خم ز ملکت جم خوشتر",
    2: "بوی قدح از غذای مریم خوشتر",
    3: "آه سحری ز سینهٔ خماری",
    4: "از نالهٔ بوسعید و ادهم خوشتر",
  },
  {
    1: "در دایره سپهر ناپیدا غور",
    2: "جامی‌ست که جمله را چشانند بدور",
    3: "نوبت چو به دور تو رسد آه مکن",
    4: "می نوش به خوشدلی که دور است نه جور",
  },
  {
    1: "دی کوزه‌گری بدیدم اندر بازار",
    2: "بر پاره گلی لگد همی زد بسیار",
    3: "و آن گل بزبان حال با او می‌گفت",
    4: "من همچو تو بوده‌ام مرا نیکودار",
  },
  {
    1: "ز آن می که حیات جاودانیست بخور",
    2: "سرمایه لذت جوانی است بخور",
    3: "سوزنده چو آتش است لیکن غم را",
    4: "سازنده چو آب زندگانی است بخور",
  },
  {
    1: "گر باده خوری تو با خردمندان خور",
    2: "یا با صنمی لاله رخی خندان خور",
    3: "بسیار مخور ورد مکن فاش مساز",
    4: "اندک خور و گه گاه خور و پنهان خور",
  },
  {
    1: "وقت سحر است خیز ای طرفه پسر",
    2: "پر بادهٔ لعل کن بلورین ساغر",
    3: "کاین یکدم عاریت در این کنج فنا",
    4: "بسیار بجویی و نیابی دیگر",
  },
  {
    1: "از جملهٔ رفتگان این راه دراز",
    2: "باز آمده‌ای کو که به ما گوید راز",
    3: "هان بر سر این دو راهه از روی نیاز",
    4: "چیزی نگذاری که نمی‌آیی باز",
  },
  {
    1: "ای پیر خردمند پگه‌تر برخیز",
    2: "و آن کودک خاکبیز را بنگر تیز",
    3: "پندش ده گو که نرم نرمک می‌بیز",
    4: "مغز سر کیقباد و چشم پرویز",
  },
  {
    1: "وقت سحر است خیز ای مایه ناز",
    2: "نرمک نرمک باده خور و چنگ نواز",
    3: "کانها که بجایند نپایند بسی",
    4: "و آنها که شدند کس نمیاید باز",
  },
  {
    1: "مرغی دیدم نشسته بر باره طوس",
    2: "در پیش نهاده کله کیکاووس",
    3: "با کله همی گفت که افسوس افسوس",
    4: "کو بانگ جرسها و کجا ناله کوس",
  },
  {
    1: "جامی است که عقل آفرین میزندش",
    2: "صد بوسۀ مهر بر جبین میزندش",
    3: "این کوزه‌گر دهر چنین جام لطیف",
    4: "می‌سازد و باز بر زمین میزندش",
  },
  {
    1: "خیام اگر ز باده مستی خوش باش",
    2: "با ماهرخی اگر نشستی خوش باش",
    3: "چون عاقبت کار جهان نیستی است",
    4: "انگار که نیستی چو هستی خوش باش",
  },
  {
    1: "در کارگه کوزه‌گری بودم دوش",
    2: "دیدم دو هزار کوزه گویای خموش",
    3: "هر یک به زبان حال با من می‌گفت",
    4: "کو کوزه‌گر و کوزه‌خر و کوزه فروش",
  },
  {
    1: "ایام زمانه از کسی دارد ننگ",
    2: "کو در غم ایام نشیند دلتنگ",
    3: "می خور تو در آبگینه با ناله چنگ",
    4: "زان پیش که آبگینه آید بر سنگ",
  },
  {
    1: "از جرم گِل سیاه تا اوج زحل",
    2: "کردم همه مشکلاتِ کلی را حل",
    3: "بگشادم بندهای مشکل به حیل",
    4: "هر بند گشاده شد به جز بند اجل",
  },
  {
    1: "با سرو قدی تازه‌تر از خرمن گل",
    2: "از دست منه جام می و دامن گل",
    3: "زان پیش که ناگه شود از باد اجل",
    4: "پیراهن عمر ما چو پیراهن گل",
  },
  {
    1: "ای دوست بیا تا غمِ فردا نخوریم",
    2: "وین یک دمِ عمر را غنیمت شمریم",
    3: "فردا که ازین دیرِ فنا درگذریم",
    4: "با هفت‌هزارسالگان سربه‌سریم",
  },
  {
    1: "این چرخ فلک که ما در او حیرانیم",
    2: "فانوس خیال از او مثالی دانیم",
    3: "خورشید چراغ دان و عالم فانوس",
    4: "ما چون صوریم کاندر او حیرانیم",
  },
  {
    1: "برخیز ز خواب تا شرابی بخوریم",
    2: "زان پیش که از زمانه تابی بخوریم",
    3: "کاین چرخ ستیزه روی ناگه روزی",
    4: "چندان ندهد زمان که آبی بخوریم",
  },
  {
    1: "برخیزم و عزم باده ناب کنم",
    2: "رنگ رخ خود به رنگ عناب کنم",
    3: "این عقل فضول پیشه را مشتی می",
    4: "بر روی زنم چنانکه در خواب کنم",
  },
  {
    1: "بر مفرش خاک خفتگان می‌بینم",
    2: "در زیرزمین نهفتگان می‌بینم",
    3: "چندانکه به صحرای عدم مینگرم",
    4: "ناآمدگان و رفتگان می‌بینم",
  },
  {
    1: "تا چند اسیر عقل هر روزه شویم",
    2: "در دهر چه صد ساله چه یکروزه شویم",
    3: "در ده تو بکاسه می از آن پیش که ما",
    4: "در کارگه کوزه‌گران کوزه شویم",
  },
  {
    1: "چون نیست مقام ما در این دهر مقیم",
    2: "پس بی می و معشوق خطائیست عظیم",
    3: "تا کی ز قدیم و محدث امیدم و بیم",
    4: "چون من رفتم جهان چه محدث چه قدیم",
  },
  {
    1: "خورشید به گل نهفت می‌نتوانم",
    2: "و اسراز زمانه گفت می‌نتوانم",
    3: "از بحر تفکرم برآورد خرد",
    4: "دری که ز بیم سفت می‌نتوانم",
  },
  {
    1: "دشمن به غلط گفت که من فلسفیم",
    2: "ایزد داند که آنچه او گفت نیم",
    3: "لیکن چو در این غم آشیان آمده‌ام",
    4: "آخر کم از آنکه من بدانم که کیم",
  },
  {
    1: "مائیم که اصل شادی و کان غمیم",
    2: "سرمایهٔ دادیم و نهاد ستمیم",
    3: "پستیم و بلندیم و کمالیم و کمیم",
    4: "آئینهٔ زنگ خورده و جام جمیم",
  },
  {
    1: "من می نه ز بهر تنگدستی نخورم",
    2: "یا از غم رسوایی و مستی نخورم",
    3: "من می ز برای خوشدلی میخوردم",
    4: "اکنون که تو بر دلم نشستی نخورم",
  },
  {
    1: "من بی می ناب زیستن نتوانم",
    2: "بی باده کشید بارتن نتوانم",
    3: "من بنده آن دمم که ساقی گوید",
    4: "یک جام دگر بگیر و من نتوانم",
  },
  {
    1: "هر یک چندی یکی برآید که منم",
    2: "با نعمت و با سیم و زر آید که منم",
    3: "چون کارک او نظام گیرد روزی",
    4: "ناگه اجل از کمین برآید که منم",
  },
  {
    1: "یک چند به کودکی باستاد شدیم",
    2: "یک چند به استادی خود شاد شدیم",
    3: "پایان سخن شنو که ما را چه رسید",
    4: "از خاک در آمدیم و بر باد شدیم",
  },
  {
    1: "یک روز ز بند عالم آزاد نیم",
    2: "یک دمزدن از وجود خود شاد نیم",
    3: "شاگردی روزگار کردم بسیار",
    4: "در کار جهان هنوز استاد نیم",
  },
  {
    1: "از دی که گذشت هیچ ازو یاد مکن",
    2: "فردا که نیامده ست فریاد مکن",
    3: "برنامده و گذشته بنیاد مکن",
    4: "حالی خوش باش و عمر بر باد مکن",
  },
  {
    1: "ای دیده اگر کور نئی گور ببین",
    2: "وین عالم پر فتنه و پر شور ببین",
    3: "شاهان و سران و سروران زیر گلند",
    4: "روهای چو مه در دهن مور ببین",
  },
  {
    1: "برخیز و مخور غم جهان گذران",
    2: "بنشین و دمی به شادمانی گذران",
    3: "در طبع جهان اگر وفایی بودی",
    4: "نوبت بتو خود نیامدی از دگران",
  },
  {
    1: "چون حاصل آدمی در این شورستان",
    2: "جز خوردن غصه نیست تا کندن جان",
    3: "خرم دل آنکه زین جهان زود برفت",
    4: "و آسوده کسی که خود نیامد به جهان",
  },
  {
    1: "رفتم که در این منزل بیداد بدن",
    2: "در دست نخواهد به جز از باد بدن",
    3: "آن را باید به مرگ من شاد بدن",
    4: "کز دست اجل تواند آزاد بدن",
  },
  {
    1: "رندی دیدم نشسته بر خنگ زمین",
    2: "نه کفر و نه اسلام و نه دنیا و نه دین",
    3: "نه حق نه حقیقت نه شریعت نه یقین",
    4: "اندر دو جهان کرا بود زهره این",
  },
  {
    1: "قانع به یک استخوان چو کرکس بودن",
    2: "به ز آن که طفیل خوان ناکس بودن",
    3: "با نان جوین خویش حقا که به است",
    4: "کالوده و پالوده هر خس بودن",
  },
  {
    1: "قومی متفکرند اندر ره دین",
    2: "قومی به گمان فتاده در راه یقین",
    3: "میترسم از آن که بانگ آید روزی",
    4: "کای بیخبران راه نه آنست و نه این",
  },
  {
    1: "گاویست در آسمان و نامش پروین",
    2: "یک گاو دگر نهفته در زیر زمین",
    3: "چشم خردت باز کن از روی یقین",
    4: "زیر و زبر دو گاو مشتی خر بین",
  },
  {
    1: "گر بر فلکم دست بدی چون یزدان",
    2: "برداشتمی من این فلک را ز میان",
    3: "از نو فلکی دگر چنان ساختمی",
    4: "کازاده بکام دل رسیدی آسان",
  },
  {
    1: "مشنو سخن از زمانه ساز آمدگان",
    2: "می خواه مروق به طراز آمدگان",
    3: "رفتند یکان یکان فراز آمدگان",
    4: "کس می ندهد نشان ز بازآمدگان",
  },
  {
    1: "می خوردن و گرد نیکوان گردیدن",
    2: "به زانکه بزرق زاهدی ورزیدن",
    3: "گر عاشق و مست دوزخی خواهد بود",
    4: "پس روی بهشت کس نخواهد دیدن",
  },
  {
    1: "نتوان دل شاد را به غم فرسودن",
    2: "وقت خوش خود بسنگ محنت سودن",
    3: "کس غیب چه داند که چه خواهد بودن",
    4: "می باید و معشوق و به کام آسودن",
  },
  {
    1: "آن قصر که با چرخ همیزد پهلو",
    2: "بر درگه آن شهان نهادندی رو",
    3: "دیدیم که بر کنگره‌اش فاخته‌ای",
    4: "بنشسته همی گفت که کوکوکوکو",
  },
  {
    1: "از آمدن و رفتن ما سودی کو",
    2: "وز تار امید عمر ما پودی کو",
    3: "چندین سروپای نازنینان جهان",
    4: "می‌سوزد و خاک می‌شود دودی کو",
  },
  {
    1: "از تن چو برفت جان پاک من و تو",
    2: "خشتی دو نهند بر مغاک من و تو",
    3: "و آنگاه برای خشت گور دگران",
    4: "در کالبدی کشند خاک من و تو",
  },
  {
    1: "می‌خور که فلک بهر هلاک من و تو",
    2: "قصدی دارد بجان پاک من و تو",
    3: "در سبزه نشین و می روشن میخور",
    4: "کاین سبزه بسی دمد ز خاک من و تو",
  },
  {
    1: "از هر چه بجز می است کوتاهی به",
    2: "می هم ز کف بتان خرگاهی به",
    3: "مستی و قلندری و گمراهی به",
    4: "یک جرعه می ز ماه تا ماهی به",
  },
  {
    1: "بنگر ز صبا دامن گل چاک شده",
    2: "بلبل ز جمال گل طربناک شده",
    3: "در سایه گل نشین که بسیار این گل",
    4: "در خاک فرو ریزد و ما خاک شده",
  },
  {
    1: "تا کی غم آن خورم که دارم یا نه",
    2: "وین عمر به خوشدلی گذارم یا نه",
    3: "پرکن قدح باده که معلومم نیست",
    4: "کاین دم که فرو برم برآرم یا نه",
  },
  {
    1: "یک جرعه می کهن ز ملکی نو به",
    2: "وز هرچه نه می طریق بیرون شو به",
    3: "در دست به از تخت فریدون صد بار",
    4: "خشت سر خم ز ملک کیخسرو به",
  },
  {
    1: "آن مایه ز دنیا که خوری یا پوشی",
    2: "معذوری اگر در طلبش میکوشی",
    3: "باقی همه رایگان نیرزد هشدار",
    4: "تا عمر گرانبها بدان نفروشی",
  },
  {
    1: "از آمدن بهار و از رفتن دی",
    2: "اوراق وجود ما همی گردد طی",
    3: "می خور! مخور اندوه که فرمود حکیم",
    4: "غمهای جهان چو زهر و تریاقش می",
  },
  {
    1: "از کوزه‌گری کوزه خریدم باری",
    2: "آن کوزه سخن گفت ز هر اسراری",
    3: "شاهی بودم که جام زرینم بود",
    4: "اکنون شده‌ام کوزه هر خماری",
  },
  {
    1: "ای آنکه نتیجهٔ چهار و هفتی",
    2: "وز هفت و چهار دایم اندر تفتی",
    3: "می خور که هزار بار بیشت گفتم",
    4: "باز آمدنت نیست چو رفتی رفتی",
  },
  {
    1: "ایدل تو به اسرار معما نرسی",
    2: "در نکته زیرکان دانا نرسی",
    3: "اینجا به می لعل بهشتی می ساز",
    4: "کانجا که بهشت است رسی یا نرسی",
  },
  {
    1: "ای دوست حقیقت شنواز من سخنی",
    2: "با باده لعل باش و با سیم تنی",
    3: "کانکس که جهان کرد فراغت دارد",
    4: "از سبلت چون تویی و ریش چو منی",
  },
  {
    1: "ای کاش که جای آرمیدن بودی",
    2: "یا این ره دور را رسیدن بودی",
    3: "کاش از پی صد هزار سال از دل خاک",
    4: "چون سبزه امید بر دمیدن بودی",
  },
  {
    1: "بر سنگ زدم دوش سبوی کاشی",
    2: "سرمست بدم که کردم این عیاشی",
    3: "با من به زبان حال می‌گفت سبو",
    4: "من چون تو بدم تو نیز چون من باشی",
  },
  {
    1: "بر شاخ امید اگر بری یافتمی",
    2: "هم رشته خویش را سری یافتمی",
    3: "تا چند ز تنگنای زندان وجود",
    4: "ای کاش سوی عدم دری یافتمی",
  },
  {
    1: "بر گیر پیاله و سبو ای دلجوی",
    2: "فارغ بنشین بکشتزار و لب جوی",
    3: "بس شخص عزیز را که چرخ بدخوی",
    4: "صد بار پیاله کرد و صد بار سبوی",
  },
  {
    1: "پیری دیدم به خانهٔ خماری",
    2: "گفتم نکنی ز رفتگان اخباری",
    3: "گفتا می خور که همچو ما بسیاری",
    4: "رفتند و خبر باز نیامد باری",
  },
  {
    1: "تا چند حدیث پنج و چار ای ساقی",
    2: "مشکل چه یکی چه صد هزار ای ساقی",
    3: "خاکیم همه چنگ بساز ای ساقی",
    4: "بادیم همه باده بیار ای ساقی",
  },
  {
    1: "چندان که نگاه می‌کنم هر سویی",
    2: "در باغ روان است ز کوثر جویی",
    3: "صحرا چو بهشت است ز کوثر کم گوی",
    4: "بنشین به بهشت با بهشتی رویی",
  },
  {
    1: "خوش باش که پخته‌اند سودای تو دی",
    2: "فارغ شده‌اند از تمنای تو دی",
    3: "قصه چه کنم که به تقاضای تو دی",
    4: "دادند قرار کار فردای تو دی",
  },
  {
    1: "در کارگه کوزه‌گری کردم رای",
    2: "در پایه چرخ دیدم استاد بپای",
    3: "میکرد دلیر کوزه را دسته و سر",
    4: "از کله پادشاه و از دست گدای",
  },
  {
    1: "در گوش دلم گفت فلک پنهانی",
    2: "حکمی که قضا بود ز من میدانی",
    3: "در گردش خویش اگر مرا دست بدی",
    4: "خود را برهاندمی ز سرگردانی",
  },
  {
    1: "زان کوزهٔ می که نیست در وی ضرری",
    2: "پر کن قدحی بخور بمن ده دگری",
    3: "زان پیشتر ای صنم که در رهگذری",
    4: "خاک من و تو کوزه‌کند کوزه‌گری",
  },
  {
    1: "گر آمدنم بخود بدی نامدمی",
    2: "ور نیز شدن بمن بدی کی شدمی",
    3: "به زان نبدی که اندر این دیر خراب",
    4: "نه آمدمی نه شدمی نه بدمی",
  },
  {
    1: "گر دست دهد ز مغز گندم نانی",
    2: "وز می دو منی ز گوسفندی رانی",
    3: "با لاله رخی و گوشه بستانی",
    4: "عیشی بود آن نه حد هر سلطانی",
  },
  {
    1: "گر کار فلک به عدل سنجیده بدی",
    2: "احوال فلک جمله پسندیده بدی",
    3: "ور عدل بدی بکارها در گردون",
    4: "کی خاطر اهل فضل رنجیده بدی",
  },
  {
    1: "هان کوزه‌گرا بپای اگر هشیاری",
    2: "تا چند کنی بر گل مردم خواری",
    3: "انگشت فریدون و کف کیخسرو",
    4: "بر چرخ نهاده‌ای چه می‌پنداری",
  },
  {
    1: "هنگام صبوح ای صنم فرخ پی",
    2: "برساز ترانه‌ای و پیش‌آور می",
    3: "کافکند بخاک صد هزاران جم و کی",
    4: "این آمدن تیرمه و رفتن دی",
  },
];

/* ----------------- Dropdown section --------------- */

poem.forEach((item, index) => {
  const li = document.createElement("li");
  const textNode = document.createTextNode(`${index + 1}`);
  li.appendChild(textNode);
  li.classList.add("dropdown-item");
  ul.appendChild(li);

  if (
    Number(textNode.data) === 2 ||
    Number(textNode.data) === 8 ||
    Number(textNode.data) === 14 ||
    Number(textNode.data) === 47 ||
    Number(textNode.data) === 66 ||
    Number(textNode.data) === 24 ||
    Number(textNode.data) === 37 ||
    Number(textNode.data) === 42 ||
    Number(textNode.data) === 43 ||
    Number(textNode.data) === 53 ||
    Number(textNode.data) === 54 ||
    Number(textNode.data) === 60 ||
    Number(textNode.data) === 111 ||
    Number(textNode.data) === 143 ||
    Number(textNode.data) === 155 ||
    Number(textNode.data) === 115 ||
    Number(textNode.data) === 117 ||
    Number(textNode.data) === 132
  ) {
    li.style.backgroundColor = "#CDF2CA";
    li.style.fontWeight = "bold";
  }
});

/* --------------------- pause audio -------------------- */

const pauseAudio = () => {
  audio.forEach((item) => {
    item.pause();
  });
};

/* ----------------- audio display section --------------- */

const displayAudio = (slideIndex) => {
  Array.from(audio).forEach((item) => {
    item.classList.add("d-none");
  });
  switch (slideIndex) {
    case 132:
    case 47:
      Array.from(audio)[0].classList.remove("d-none");
      break;
    case 24:
      Array.from(audio)[1].classList.remove("d-none");
      break;
    case 0:
    case 66:
      Array.from(audio)[2].classList.remove("d-none");
      break;
    case 0:
    case 60:
      Array.from(audio)[3].classList.remove("d-none");
      break;
    case 0:
    case 115:
      Array.from(audio)[6].classList.remove("d-none");
      break;
    case 0:
    case 117:
      Array.from(audio)[7].classList.remove("d-none");
      break;
    case 0:
    case 54:
      Array.from(audio)[8].classList.remove("d-none");
      break;
    case 0:
    case 111:
      Array.from(audio)[9].classList.remove("d-none");
      break;
    case 0:
    case 37:
      Array.from(audio)[10].classList.remove("d-none");
      break;
    case 0:
    case 42:
      Array.from(audio)[11].classList.remove("d-none");
      break;
    case 0:
    case 155:
      Array.from(audio)[12].classList.remove("d-none");
      break;
    case 0:
    case 143:
      Array.from(audio)[13].classList.remove("d-none");
      break;
    case 0:
    case 53:
      Array.from(audio)[14].classList.remove("d-none");
      break;
    case 0:
    case 14:
      Array.from(audio)[15].classList.remove("d-none");
      break;
    case 2:
    case 43:
      Array.from(audio)[16].classList.remove("d-none");
      break;
    case 8:
      Array.from(audio)[1].classList.remove("d-none");
      Array.from(audio)[16].classList.remove("d-none");
      break;
  }
};

/* ------------------- poetry display ----------------- */

var slideIndex = 1;
showSlides(slideIndex);

function plusSlides(n) {
  showSlides((slideIndex += n));
}

function showSlides(n) {
  var slides = document.querySelectorAll("p");

  if (n > poem.length) slideIndex = 1;
  if (n < 1) slideIndex = poem.length;

  slides.forEach((item, index) => {
    h6.innerText = `رباعی شمارهٔ ${slideIndex}`;
    item.innerText = poem[slideIndex - 1][index + 1];
  });

  pauseAudio();
  displayAudio(slideIndex);
}

/* ------- select number of poetry in dropdown ------ */

ul.addEventListener("click", (e) => {
  poem.forEach((item, index) => {
    if (Number(e.target.innerText) === index + 1) {
      slideIndex = Number(e.target.innerText);
      showSlides(slideIndex);
    }
  });
});

/* ----------------- search section --------------- */

const findPoem = (text) => {
  for (const key in poem) {
    for (const x in poem[key]) {
      if (poem[key][x].includes(text)) {
        return Number(key) + 1;
      }
    }
  }
};

search.addEventListener("submit", (e) => {
  e.preventDefault();
  const text = e.target[1].value.trim();

  slideIndex = findPoem(text);
  if (slideIndex) showSlides(slideIndex);
});
