// const p = document.querySelectorAll("p");
const next = document.querySelector(".nxt");
const prev = document.querySelector(".pre");

const poem = [
  {
    1: "برخیز بتا بیا ز بهر دل ما",
    2: "حل کن به جمال خویشتن مشکل ما",
    3: "یک کوزه شراب تا به هم نوش کنیم",
    4: "زآن پیش که کوزه‌ها کنند از گل ما",
  },
  {
    1: "چون عهده نمی‌شود کسی فردا را",
    2: "حالی خوش دار این دل پر سودا را",
    3: "می نوش به ماهتاب ای ماه که ماه",
    4: "بسیار بتابد و نیابد ما را",
  },
  {
    1: "قرآن که مهین کلام خوانند آن را",
    2: "گهگاه نه بر دوام خوانند آن را",
    3: "بر گرد پیاله آیتی هست مقیم",
    4: "کاندر همه جا مدام خوانند آن را",
  },
  {
    1: "گر می نخوری طعنه مزن مستان را",
    2: "بنیاد مکن تو حیله و دستان را",
    3: "تو غره بدان مشو که می می‌نخوری",
    4: "صد لقمه خوری که می غلام است آن را",
  },
  {
    1: "هر چند که رنگ و بوی زیباست مرا",
    2: "چون لاله رخ و چو سرو بالاست مرا",
    3: "معلوم نشد که در طربخانۀ خاک",
    4: "نقاش ازل بهر چه آراست مرا",
  },
  {
    1: "ماییم و می و مطرب و این کنج خراب",
    2: "جان و دل و جام و جامه پر درد شراب",
    3: "فارغ ز امید رحمت و بیم عذاب",
    4: "آزاد ز خاک و باد و از آتش و آب",
  },
  {
    1: "آن قصر که جمشید در او جام گرفت",
    2: "آهو بچه کرد و روبه آرام گرفت",
    3: "بهرام که گور می‌گرفتی همه عمر",
    4: "دیدی که چگونه گور بهرام گرفت",
  },
  {
    1: "ابر آمد و باز بر سر سبزه گریست",
    2: "بی بادهٔ گلرنگ نمی‌باید زیست",
    3: "این سبزه که امروز تماشاگه ماست",
    4: "تا سبزهٔ خاک ما تماشاگه کیست",
  },
  {
    1: "اکنون که گل سعادتت پربار است",
    2: "دست تو ز جام می چرا بیکار است",
    3: "می خور که زمانه دشمنی غدار است",
    4: "دریافتن روز چنین دشوار است",
  },
  {
    1: "امروز تو را دسترس فردا نیست",
    2: "واندیشهٔ فردات به جز سودا نیست",
    3: "ضایع مکن این دم ار دلت شیدا نیست",
    4: "کاین باقی عمر را بها پیدا نیست",
  },
  {
    1: "این قافله عمر عجب می گذرد",
    2: "دریاب دمی که با طرب می گذرد",
    3: "ساقی غم فردای حریفان چه خوری",
    4: "پیشار پیاله را که شب می گذرد",
  },
  {
    1: "می نوش که عمر جاودانی این است",
    2: "خود حاصلت از دور جوانی این است",
    3: "هنگام گل و باده و یاران سرمست",
    4: "خوش باش دمی که زندگانی این است",
  },
  // {
  //   1: "",
  //   2: "",
  //   3: "",
  //   4: "",
  // },
  
];

var slideIndex = 1;
showSlides(slideIndex);

function plusSlides(n) {
  showSlides((slideIndex += n));
}

function showSlides(n) {
  var slides = document.querySelectorAll("p");

  if (n > poem.length) slideIndex = 1;
  if (n < 1) slideIndex = poem.length;

  slides.forEach((item, index) => {
    item.innerText = poem[slideIndex - 1][index + 1];
  });
}
