const search = document.querySelector(".search");
const next = document.querySelector(".nxt");
const prev = document.querySelector(".pre");
const ul = document.querySelector("ul");
const h6 = document.querySelector("h6");

const poem = [
  {
    1: "برخیز بتا بیا ز بهر دل ما",
    2: "حل کن به جمال خویشتن مشکل ما",
    3: "یک کوزه شراب تا به هم نوش کنیم",
    4: "زآن پیش که کوزه‌ها کنند از گل ما",
  },
  {
    1: "چون عهده نمی‌شود کسی فردا را",
    2: "حالی خوش دار این دل پر سودا را",
    3: "می نوش به ماهتاب ای ماه که ماه",
    4: "بسیار بتابد و نیابد ما را",
  },
  {
    1: "قرآن که مهین کلام خوانند آن را",
    2: "گهگاه نه بر دوام خوانند آن را",
    3: "بر گرد پیاله آیتی هست مقیم",
    4: "کاندر همه جا مدام خوانند آن را",
  },
  {
    1: "گر می نخوری طعنه مزن مستان را",
    2: "بنیاد مکن تو حیله و دستان را",
    3: "تو غره بدان مشو که می می‌نخوری",
    4: "صد لقمه خوری که می غلام است آن را",
  },
  {
    1: "هر چند که رنگ و بوی زیباست مرا",
    2: "چون لاله رخ و چو سرو بالاست مرا",
    3: "معلوم نشد که در طربخانۀ خاک",
    4: "نقاش ازل بهر چه آراست مرا",
  },
  {
    1: "ماییم و می و مطرب و این کنج خراب",
    2: "جان و دل و جام و جامه پر درد شراب",
    3: "فارغ ز امید رحمت و بیم عذاب",
    4: "آزاد ز خاک و باد و از آتش و آب",
  },
  {
    1: "آن قصر که جمشید در او جام گرفت",
    2: "آهو بچه کرد و روبه آرام گرفت",
    3: "بهرام که گور می‌گرفتی همه عمر",
    4: "دیدی که چگونه گور بهرام گرفت",
  },
  {
    1: "ابر آمد و باز بر سر سبزه گریست",
    2: "بی بادهٔ گلرنگ نمی‌باید زیست",
    3: "این سبزه که امروز تماشاگه ماست",
    4: "تا سبزهٔ خاک ما تماشاگه کیست",
  },
  {
    1: "اکنون که گل سعادتت پربار است",
    2: "دست تو ز جام می چرا بیکار است",
    3: "می خور که زمانه دشمنی غدار است",
    4: "دریافتن روز چنین دشوار است",
  },
  {
    1: "امروز تو را دسترس فردا نیست",
    2: "واندیشهٔ فردات به جز سودا نیست",
    3: "ضایع مکن این دم ار دلت شیدا نیست",
    4: "کاین باقی عمر را بها پیدا نیست",
  },
  {
    1: "ای آمده از عالم روحانی تفت",
    2: "حیران شده در پنج و چهار و شش و هفت",
    3: "می نوش ندانی ز کجا آمده‌ای",
    4: "خوش باش ندانی به کجا خواهی رفت",
  },
  {
    1: "ای چرخ فلک خرابی از کینهٔ توست",
    2: "بیدادگری شیوهٔ دیرینهٔ توست",
    3: "ای خاک اگر سینه تو بشکافند",
    4: "بس گوهر قیمتی که در سینهٔ توست",
  },
  {
    1: "ای دل چو زمانه می‌کند غمناکت",
    2: "ناگه برود ز تن روان پاکت",
    3: "بر سبزه نشین و خوش بزی روزی چند",
    4: "زآن پیش که سبزه بر دمد از خاکت",
  },
  {
    1: "این بحر وجود آمده بیرون ز نهفت",
    2: "کس نیست که این گوهر تحقیق بسفت",
    3: "هر کس سخنی از سر سودا گفتند",
    4: "زآن روی که هست کس نمی‌داند گفت",
  },
  {
    1: "این کوزه چو من عاشق زاری بوده‌ست",
    2: "در بند سر زلف نگاری بوده‌ست",
    3: "این دسته که بر گردن او می‌بینی",
    4: "دستی‌ست که بر گردن یاری بوده‌ست",
  },
  {
    1: "این کوزه که آبخوارهٔ مزدوری‌ست",
    2: "از دیدهٔ شاهی و دل دستوری‌ست",
    3: "هر کاسهٔ می که بر کف مخموری‌ست",
    4: "از عارض مستی و لب مستوری‌ست",
  },
  {
    1: "این کهنه رباط را که عالم نام است",
    2: "وآرامگه ابلق صبح و شام است",
    3: "بزمی‌ست که واماندۀ صد جمشید است",
    4: "قصری‌ست که تکیه‌گاه صد بهرام است",
  },
  {
    1: "این یک دو سه روز نوبت عمر گذشت",
    2: "چون آب به جویبار و چون باد به دشت",
    3: "هرگز غم دو روز مرا یاد نگشت",
    4: "روزی که نیامده‌ست و روزی که گذشت",
  },
  {
    1: "بر چهرۀ گل نسیم نوروز خوش است",
    2: "در صحن چمن روی دل‌افروز خوش است",
    3: "از دی که گذشت هر چه گویی خوش نیست",
    4: "خوش باش و ز دی مگو که امروز خوش است",
  },
  {
    1: "پیش از من و تو لیل و نهاری بوده‌ست",
    2: "گردنده فلک نیز بکاری بوده است",
    3: "هرجا که قدم نهی تو بر روی زمین",
    4: "آن مردمک چشم نگاری بوده‌ست",
  },
  {
    1: "تا چند زنم به روی دریاها خشت",
    2: "بیزار شدم ز بت‌پرستان کنشت",
    3: "خیام ، که گفت دوزخی خواهد بود",
    4: "که رفت به دوزخ و که آمد ز بهشت",
  },
  {
    1: "ترکیب پیاله‌ای که در هم پیوست",
    2: "بشکستن آن روا نمی‌دارد مست",
    3: "چندین سر و پای نازنین از سر و دست",
    4: "از مهر که پیوست و به کین که شکست",
  },
  {
    1: "ترکیب طبایع چو به کام تو دمی‌ست",
    2: "رو شاد بزی اگرچه بر تو ستمی‌ست",
    3: "با اهل خرد باش که اصل تن تو",
    4: "گردی و نسیمی و غباری و دمی‌ست",
  },
  {
    1: "چون ابر به نوروز رخ لاله بشست",
    2: "برخیز و به جام باده کن عزم درست",
    3: "کاین سبزه که امروز تماشاگه توست",
    4: "فردا همه از خاک تو برخواهد رست",
  },
  {
    1: "چون بلبل مست راه در بستان یافت",
    2: "روی گل و جام باده را خندان یافت",
    3: "آمد به زبان حال در گوشم گفت",
    4: "دریاب که عمر رفته را نتوان یافت",
  },
  {
    1: "چون چرخ به کام یک خردمند نگشت",
    2: "خواهی تو فلک هفت شمر خواهی هشت",
    3: "چون باید مرد و آرزوها همه هشت",
    4: "چه مور خورد به گور و چه گرگ به دشت",
  },
  {
    1: "چون لاله به نوروز قدح گیر به دست",
    2: "با لاله‌رخی اگر تو را فرصت هست",
    3: "می نوش به خرمی که این چرخ کهن",
    4: "ناگاه تو را چو خاک گرداند پست",
  },
  {
    1: "چون نیست حقیقت و یقین اندر دست",
    2: "نتوان به امید شک همه عمر نشست",
    3: "هان تا ننهیم جام می از کف دست",
    4: "در بی‌خبری مرد چه هشیار و چه مست",
  },
  {
    1: "چون نیست ز هرچه هست جز باد به دست",
    2: "چون هست به هرچه هست نقصان و شکست",
    3: "انگار که هرچه هست در عالم نیست",
    4: "پندار که هرچه نیست در عالم هست",
  },
  {
    1: "خاکی که به زیر پای هر نادانی‌ست",
    2: "کفّ صنمیّ و چهرهٔ جانانی‌ست",
    3: "هر خشت که بر کنگرهٔ ایوانی‌ست",
    4: "انگشت وزیر یا سر سلطانی‌ست",
  },
  {
    1: "دارنده چو ترکیب طبایع آراست",
    2: "از بهر چه اوفکندش اندر کم و کاست",
    3: "گر نیک آمد شکستن از بهر چه بود",
    4: "ور نیک نیامد این صور عیب که راست",
  },
  {
    1: "در پردۀ اسرار کسی را ره نیست",
    2: "زین تعبیه جان هیچ‌کس آگه نیست",
    3: "جز در دل خاک هیچ منزلگه نیست",
    4: "می خور که چنین فسانه‌ها کوته نیست",
  },
  {
    1: "در خواب بدم مرا خردمندی گفت",
    2: "کز خواب کسی را گل شادی نشکفت",
    3: "کاری چه کنی که با اجل باشد جفت؟",
    4: "می خور که به زیر خاک می‌باید خفت",
  },
  {
    1: "در دایره‌ای که آمد و رفتن ماست",
    2: "او را نه بدایت نه نهایت پیداست",
    3: "کس می‌نزند دمی در این معنی راست",
    4: "کاین آمدن از کجا و رفتن به کجاست",
  },
  {
    1: "در فصل بهار اگر بتی حور سرشت",
    2: "یک ساغر می دهد مرا بر لب کشت",
    3: "هر چند به نزد عامه این باشد زشت",
    4: "سگ به ز من است اگر برم نام بهشت",
  },
  {
    1: "دریاب که از روح جدا خواهی رفت",
    2: "در پردۀ اسرار فنا خواهی رفت",
    3: "می نوش ندانی از کجا آمده‌ای",
    4: "خوش باش ندانی به کجا خواهی رفت",
  },
  {
    1: "ساقی گل و سبزه بس طربناک شده‌ست",
    2: "دریاب که هفته دگر خاک شده‌ست",
    3: "می نوش و گلی بچین که تا درنگری",
    4: "گل خاک شده‌ست و سبزه خاشاک شده‌ست",
  },
  {
    1: "عمری‌ست مرا تیره و کاری‌ست نه راست",
    2: "محنت همه افزوده و راحت کم و کاست",
    3: "شکر ایزد را که آنچه اسباب بلاست",
    4: "ما را ز کس دگر نمی‌باید خواست",
  },
  {
    1: "فصل گل و طرف جویبار و لب کشت",
    2: "با یک دو سه اهل و لعبتی حورسرشت",
    3: "پیش آر قدح که باده‌نوشان صبوح",
    4: "آسوده ز مسجدند و فارغ ز کنشت",
  },
  {
    1: "گر شاخ بقا ز بیخ بختت رستست",
    2: "ور بر تن تو عمر لباسی چستست",
    3: "در خیمه تن که سایبانی‌ست ترا",
    4: "هان تکیه مکن که چارمیخش سستست",
  },
  {
    1: "گویند کسان بهشت با حور خوش است",
    2: "من می‌گویم که آب انگور خوش است",
    3: "این نقد بگیر و دست از آن نسیه بدار",
    4: "کآواز دهل شنیدن از دور خوش است",
  },
  {
    1: "گویند مرا که دوزخی باشد مست",
    2: "قولی‌ست خلاف ، دل در آن نتوان بست",
    3: "گر عاشق و میخواره به دوزخ باشند",
    4: "فردا بینی بهشت همچون کف دست",
  },
  {
    1: "من هیچ ندانم که مرا آن‌که سرشت",
    2: "از اهل بهشت کرد یا دوزخ زشت",
    3: "جامی و بتی و بربطی بر لب کشت",
    4: "این هرسه مرا نقد و تو را نسیه بهشت",
  },
  {
    1: "مهتاب به نور دامن شب بشکافت",
    2: "می نوش دمی بهتر از این نتوان یافت",
    3: "خوش باش و میندیش که مهتاب بسی",
    4: "اندر سر خاک یک به یک خواهد تافت",
  },
  {
    1: "می خوردن و شاد بودن آیین من است",
    2: "فارغ بودن ز کفر و دین دین من است",
    3: "گفتم به عروس دهر کابین تو چیست",
    4: "گفتا دل خرم تو کابین من است",
  },
  {
    1: "می لعل مذاب است و صراحی کان است",
    2: "جسم است پیاله و شرابش جان است",
    3: "آن جام بلورین که ز می خندان است",
    4: "اشکی است که خون دل در او پنهان است",
  },
  {
    1: "می نوش که عمر جاودانی این است",
    2: "خود حاصلت از دور جوانی این است",
    3: "هنگام گل و باده و یاران سرمست",
    4: "خوش باش دمی که زندگانی این است",
  },
  {
    1: "نیکی و بدی که در نهاد بشر است",
    2: "شادی و غمی که در قضا و قدر است",
    3: "با چرخ مکن حواله کاندر ره عقل",
    4: "چرخ از تو هزار بار بیچاره‌تر است",
  },
  {
    1: "در هر دشتی که لاله‌زاری بوده‌ست",
    2: "از سرخی خون شهریاری بوده‌ست",
    3: "هر شاخ بنفشه کز زمین می‌روید",
    4: "خالی‌ست که بر رخ نگاری بوده‌ست",
  },
  {
    1: "هر ذره که در خاک زمینی بوده‌ست",
    2: "پیش از من و تو تاج و نگینی بوده‌ست",
    3: "گرد از رخ نازنین به آزرم فشان",
    4: "کآن هم رخ خوب نازنینی بوده‌ست",
  },
  {
    1: "هر سبزه که بر کنار جویی رسته‌ست",
    2: "گویی ز لب فرشته‌خویی رسته‌ست",
    3: "پا بر سر سبزه تا به خواری ننهی",
    4: "کآن سبزه ز خاک لاله‌رویی رسته‌ست",
  },
  {
    1: "یک جرعهٔ می ز ملک کاووس به است",
    2: "از تخت قباد و ملکت طوس به است",
    3: "هر ناله که رندی به سحرگاه زند",
    4: "از طاعت زاهدان سالوس به است",
  },
  {
    1: "چون عمر به سر رسد چه شیرین و چه تلخ",
    2: "پیمانه چو پر شود چه بغداد و چه بلخ",
    3: "می نوش که بعد از من و تو ماه بسی",
    4: "از سَلخ به غٌرّه آید از غره به سلخ",
  },
  {
    1: "آنان که محیط فضل و آداب شدند",
    2: "در جمع کمال شمع اصحاب شدند",
    3: "ره زین شب تاریک نبردند برون",
    4: "گفتند فسانه‌ای و در خواب شدند",
  },
  {
    1: "آن را که به صحرای علل تاخته‌اند",
    2: "بی او همه کارها بپرداخته‌اند",
    3: "امروز بهانه‌ای درانداخته‌اند",
    4: "فردا همه آن بود که درساخته‌اند",
  },
  {
    1: "آن‌ها که کهن شدند و این‌ها که نوند",
    2: "هر کس به مراد خویش یک تک به دوند",
    3: "این کهنه‌جهان به کس نماند باقی",
    4: "رفتند و رویم دیگر آیند و روند",
  },
  {
    1: "آن‌کس که زمین و چرخ و افلاک نهاد",
    2: "بس داغ که او بر دل غمناک نهاد",
    3: "بسیار لب چو لعل و زلفین چو مشک",
    4: "در طبل زمین و حقهٔ خاک نهاد",
  },
  {
    1: "آرند یکی و دیگری بربایند",
    2: "بر هیچ‌کسی راز همی‌نگشایند",
    3: "ما را ز قضا جز این قدر ننمایند",
    4: "پیمانهٔ عمر ماست می‌پیمایند",
  },
  {
    1: "اجرام که ساکنان این ایوان‌اند",
    2: "اسباب تردد خردمندان‌اند",
    3: "هان تا سر رشتهٔ خرد گم نکنی",
    4: "کآنان که مدبرند سرگردان‌اند",
  },
  {
    1: "از آمدنم نبود گردون را سود",
    2: "وز رفتن من جلال و جاهش نفزود",
    3: "وز هیچ کسی نیز دو گوشم نشنود",
    4: "کاین آمدن و رفتنم از بهر چه بود",
  },
  {
    1: "از رنج کشیدن آدمی حر گردد",
    2: "قطره چو کشد حبس صدف در گردد",
    3: "گر مال نماند سر بماناد به جای",
    4: "پیمانه چو شد تهی دگر پر گردد",
  },
  {
    1: "افسوس که سرمایه ز کف بیرون شد",
    2: "وز دست اجل بسی جگرها خون شد",
    3: "کس نآمد از آن جهان که پرسم از وی",
    4: "کاحوال مسافران دنیا چون شد",
  },
  {
    1: "افسوس که نامهٔ جوانی طی شد",
    2: "و آن تازه بهار زندگانی دی شد",
    3: "آن مرغ طرب که نام او بود شباب",
    4: "افسوس ندانم که کی آمد کی شد",
  },
  {
    1: "ای بس که نباشیم و جهان خواهد بود",
    2: "نی نام ز ما و نی‌ نشان خواهد بود",
    3: "زین پیش نبودیم و نبد هیچ خلل",
    4: "زین پس چو نباشیم همان خواهد بود",
  },
  {
    1: "این عقل که در ره سعادت پوید",
    2: "روزی صد بار خود تو را می‌گوید",
    3: "دریاب تو این یک دم وقتت که نه‌ای",
    4: "آن تره که بدروند و دیگر روید",
  },
  {
    1: "این قافله عمر عجب می گذرد",
    2: "دریاب دمی که با طرب می گذرد",
    3: "ساقی غم فردای حریفان چه خوری",
    4: "پیشار پیاله را که شب می گذرد",
  },
  {
    1: "بر پشت من از زمانه تو می‌آید",
    2: "وز من همه کار نانکو می‌آید",
    3: "جان عزم رحیل کرد و گفتم بمرو",
    4: "گفتا چه کنم خانه فرومی‌آید",
  },
  {
    1: "بر چرخ فلک هیچ کسی چیر نشد",
    2: "وز خوردن آدمی زمین سیر نشد",
    3: "مغرور بدانی که نخورده‌ست تو را",
    4: "تعجیل مکن هم بخورد دیر نشد",
  },
  {
    1: "بر چشم تو عالم ارچه می‌آرایند",
    2: "مگرای بدان که عاقلان نگرایند",
    3: "بسیار چو تو روند و بسیار آیند",
    4: "بربای نصیب خویش کت بربایند",
  },
  {
    1: "بر من قلم قضا چو بی من رانند",
    2: "پس نیک و بدش ز من چرا می‌دانند",
    3: "دی بی من و امروز چو دی بی من و تو",
    4: "فردا به چه حجتم به داور خوانند",
  },
  // {
  //   1: "",
  //   2: "",
  //   3: "",
  //   4: "",
  // }
];

/* ----------------- Dropdown section --------------- */

poem.forEach((item, index) => {
  const li = document.createElement("li");
  const textNode = document.createTextNode(`${index + 1}`);
  li.appendChild(textNode);
  li.classList.add("dropdown-item");
  ul.appendChild(li);
});

/* ------------------- poem display ----------------- */

var slideIndex = 1;
showSlides(slideIndex);

function plusSlides(n) {
  showSlides((slideIndex += n));
}

function showSlides(n) {
  var slides = document.querySelectorAll("p");

  if (n > poem.length) slideIndex = 1;
  if (n < 1) slideIndex = poem.length;

  slides.forEach((item, index) => {
    h6.innerText = `رباعی شمارهٔ ${slideIndex}`;
    item.innerText = poem[slideIndex - 1][index + 1];
  });
}

/* ------- select number of poem in dropdown ------ */

ul.addEventListener("click", (e) => {
  poem.forEach((item, index) => {
    if (Number(e.target.innerText) === index + 1) {
      slideIndex = Number(e.target.innerText);
      showSlides(slideIndex);
    }
  });
});

/* ----------------- search section --------------- */

const findPoem = (text) => {
  for (const key in poem) {
    for (const x in poem[key]) {
      if (poem[key][x].includes(text)) {
        return Number(key)+1;
      }
    }
  }
};

search.addEventListener("submit", (e) => {
  e.preventDefault();

  const text = e.target[1].value;

  slideIndex = findPoem(text);

  showSlides(slideIndex);

  
});
