const next = document.querySelector(".nxt");
const prev = document.querySelector(".pre");
const ul = document.querySelector("ul");

const poem = [
  {
    1: "برخیز بتا بیا ز بهر دل ما",
    2: "حل کن به جمال خویشتن مشکل ما",
    3: "یک کوزه شراب تا به هم نوش کنیم",
    4: "زآن پیش که کوزه‌ها کنند از گل ما",
  },
  {
    1: "چون عهده نمی‌شود کسی فردا را",
    2: "حالی خوش دار این دل پر سودا را",
    3: "می نوش به ماهتاب ای ماه که ماه",
    4: "بسیار بتابد و نیابد ما را",
  },
  {
    1: "قرآن که مهین کلام خوانند آن را",
    2: "گهگاه نه بر دوام خوانند آن را",
    3: "بر گرد پیاله آیتی هست مقیم",
    4: "کاندر همه جا مدام خوانند آن را",
  },
  {
    1: "گر می نخوری طعنه مزن مستان را",
    2: "بنیاد مکن تو حیله و دستان را",
    3: "تو غره بدان مشو که می می‌نخوری",
    4: "صد لقمه خوری که می غلام است آن را",
  },
  {
    1: "هر چند که رنگ و بوی زیباست مرا",
    2: "چون لاله رخ و چو سرو بالاست مرا",
    3: "معلوم نشد که در طربخانۀ خاک",
    4: "نقاش ازل بهر چه آراست مرا",
  },
  {
    1: "ماییم و می و مطرب و این کنج خراب",
    2: "جان و دل و جام و جامه پر درد شراب",
    3: "فارغ ز امید رحمت و بیم عذاب",
    4: "آزاد ز خاک و باد و از آتش و آب",
  },
  {
    1: "آن قصر که جمشید در او جام گرفت",
    2: "آهو بچه کرد و روبه آرام گرفت",
    3: "بهرام که گور می‌گرفتی همه عمر",
    4: "دیدی که چگونه گور بهرام گرفت",
  },
  {
    1: "ابر آمد و باز بر سر سبزه گریست",
    2: "بی بادهٔ گلرنگ نمی‌باید زیست",
    3: "این سبزه که امروز تماشاگه ماست",
    4: "تا سبزهٔ خاک ما تماشاگه کیست",
  },
  {
    1: "اکنون که گل سعادتت پربار است",
    2: "دست تو ز جام می چرا بیکار است",
    3: "می خور که زمانه دشمنی غدار است",
    4: "دریافتن روز چنین دشوار است",
  },
  {
    1: "امروز تو را دسترس فردا نیست",
    2: "واندیشهٔ فردات به جز سودا نیست",
    3: "ضایع مکن این دم ار دلت شیدا نیست",
    4: "کاین باقی عمر را بها پیدا نیست",
  },
  {
    1: "ای آمده از عالم روحانی تفت",
    2: "حیران شده در پنج و چهار و شش و هفت",
    3: "می نوش ندانی ز کجا آمده‌ای",
    4: "خوش باش ندانی به کجا خواهی رفت",
  },
  {
    1: "ای چرخ فلک خرابی از کینهٔ توست",
    2: "بیدادگری شیوهٔ دیرینهٔ توست",
    3: "ای خاک اگر سینه تو بشکافند",
    4: "بس گوهر قیمتی که در سینهٔ توست",
  },
  {
    1: "ای دل چو زمانه می‌کند غمناکت",
    2: "ناگه برود ز تن روان پاکت",
    3: "بر سبزه نشین و خوش بزی روزی چند",
    4: "زآن پیش که سبزه بر دمد از خاکت",
  },
  {
    1: "این بحر وجود آمده بیرون ز نهفت",
    2: "کس نیست که این گوهر تحقیق بسفت",
    3: "هر کس سخنی از سر سودا گفتند",
    4: "زآن روی که هست کس نمی‌داند گفت",
  },
  {
    1: "این کوزه چو من عاشق زاری بوده‌ست",
    2: "در بند سر زلف نگاری بوده‌ست",
    3: "این دسته که بر گردن او می‌بینی",
    4: "دستی‌ست که بر گردن یاری بوده‌ست",
  },
  {
    1: "این کوزه که آبخوارهٔ مزدوری‌ست",
    2: "از دیدهٔ شاهی و دل دستوری‌ست",
    3: "هر کاسهٔ می که بر کف مخموری‌ست",
    4: "از عارض مستی و لب مستوری‌ست",
  },
  {
    1: "این کهنه رباط را که عالم نام است",
    2: "وآرامگه ابلق صبح و شام است",
    3: "بزمی‌ست که واماندۀ صد جمشید است",
    4: "قصری‌ست که تکیه‌گاه صد بهرام است",
  },
  {
    1: "این یک دو سه روز نوبت عمر گذشت",
    2: "چون آب به جویبار و چون باد به دشت",
    3: "هرگز غم دو روز مرا یاد نگشت",
    4: "روزی که نیامده‌ست و روزی که گذشت",
  },
  {
    1: "بر چهرۀ گل نسیم نوروز خوش است",
    2: "در صحن چمن روی دل‌افروز خوش است",
    3: "از دی که گذشت هر چه گویی خوش نیست",
    4: "خوش باش و ز دی مگو که امروز خوش است",
  },
  {
    1: "پیش از من و تو لیل و نهاری بوده‌ست",
    2: "گردنده فلک نیز بکاری بوده است",
    3: "هرجا که قدم نهی تو بر روی زمین",
    4: "آن مردمک چشم نگاری بوده‌ست",
  },
  {
    1: "تا چند زنم به روی دریاها خشت",
    2: "بیزار شدم ز بت‌پرستان کنشت",
    3: "خیام ، که گفت دوزخی خواهد بود",
    4: "که رفت به دوزخ و که آمد ز بهشت",
  },
  {
    1: "ترکیب پیاله‌ای که در هم پیوست",
    2: "بشکستن آن روا نمی‌دارد مست",
    3: "چندین سر و پای نازنین از سر و دست",
    4: "از مهر که پیوست و به کین که شکست",
  },
  {
    1: "ترکیب طبایع چو به کام تو دمی‌ست",
    2: "رو شاد بزی اگرچه بر تو ستمی‌ست",
    3: "با اهل خرد باش که اصل تن تو",
    4: "گردی و نسیمی و غباری و دمی‌ست",
  },
  {
    1: "چون ابر به نوروز رخ لاله بشست",
    2: "برخیز و به جام باده کن عزم درست",
    3: "کاین سبزه که امروز تماشاگه توست",
    4: "فردا همه از خاک تو برخواهد رست",
  },
  {
    1: "چون بلبل مست راه در بستان یافت",
    2: "روی گل و جام باده را خندان یافت",
    3: "آمد به زبان حال در گوشم گفت",
    4: "دریاب که عمر رفته را نتوان یافت",
  },
  {
    1: "چون چرخ به کام یک خردمند نگشت",
    2: "خواهی تو فلک هفت شمر خواهی هشت",
    3: "چون باید مرد و آرزوها همه هشت",
    4: "چه مور خورد به گور و چه گرگ به دشت",
  },
  {
    1: "چون لاله به نوروز قدح گیر به دست",
    2: "با لاله‌رخی اگر تو را فرصت هست",
    3: "می نوش به خرمی که این چرخ کهن",
    4: "ناگاه تو را چو خاک گرداند پست",
  },
  {
    1: "چون نیست حقیقت و یقین اندر دست",
    2: "نتوان به امید شک همه عمر نشست",
    3: "هان تا ننهیم جام می از کف دست",
    4: "در بی‌خبری مرد چه هشیار و چه مست",
  },
  {
    1: "چون نیست ز هرچه هست جز باد به دست",
    2: "چون هست به هرچه هست نقصان و شکست",
    3: "انگار که هرچه هست در عالم نیست",
    4: "پندار که هرچه نیست در عالم هست",
  },
  {
    1: "خاکی که به زیر پای هر نادانی‌ست",
    2: "کفّ صنمیّ و چهرهٔ جانانی‌ست",
    3: "هر خشت که بر کنگرهٔ ایوانی‌ست",
    4: "انگشت وزیر یا سر سلطانی‌ست",
  },
  {
    1: "دارنده چو ترکیب طبایع آراست",
    2: "از بهر چه اوفکندش اندر کم و کاست",
    3: "گر نیک آمد شکستن از بهر چه بود",
    4: "ور نیک نیامد این صور عیب که راست",
  },
  {
    1: "این قافله عمر عجب می گذرد",
    2: "دریاب دمی که با طرب می گذرد",
    3: "ساقی غم فردای حریفان چه خوری",
    4: "پیشار پیاله را که شب می گذرد",
  },
  {
    1: "می نوش که عمر جاودانی این است",
    2: "خود حاصلت از دور جوانی این است",
    3: "هنگام گل و باده و یاران سرمست",
    4: "خوش باش دمی که زندگانی این است",
  },
  // {
  //   1: "",
  //   2: "",
  //   3: "",
  //   4: "",
  // },
  
];

/* ------------------- || ----------------- */

poem.forEach((item, index) => {
  const li = document.createElement("li");
  const textNode = document.createTextNode(`${index + 1}`);
  li.appendChild(textNode);
  li.classList.add("dropdown-item");
  ul.appendChild(li);
});

/* ------------------- || ----------------- */

var slideIndex = 1;
showSlides(slideIndex);

function plusSlides(n) {
  showSlides((slideIndex += n));
}

function showSlides(n) {
  var slides = document.querySelectorAll("p");

  if (n > poem.length) slideIndex = 1;
  if (n < 1) slideIndex = poem.length;

  slides.forEach((item, index) => {
    item.innerText = poem[slideIndex - 1][index + 1];
  });
}

/* ------------------- || ----------------- */

ul.addEventListener("click", (e) => {
  poem.forEach((item, index) => {
    if (Number(e.target.innerText) === index + 1) {
      slideIndex = Number(e.target.innerText);
      showSlides(slideIndex);
    }
  });
});
